---
kind: property
id: P:Autodesk.Revit.DB.TableData.NumberOfSections
source: html/4f57f099-a0cb-6d95-2716-a5c3417654d4.htm
---
# Autodesk.Revit.DB.TableData.NumberOfSections Property

Gets the number of items in section data array.

## Syntax (C#)
```csharp
public int NumberOfSections { get; }
```